# Using pandasql and SQLite to train SQL
# Utilizaçao do SQL através da biblioteca pandasql

---
Research fonts: 
1.   Primary author: https://www.youtube.com/c/ritvikmath
2.   Secondary author: https://github.com/GuilhermeRuy97
3.   https://pypi.org/project/pandasql/
4.   https://www.sqlite.org/docs.html
---

# Import

In [1]:
# Ambient configuration

# $ pip install -U pandasql
!pip install pandasql

Looking in indexes: https://pypi.org/simple, https://us-python.pkg.dev/colab-wheels/public/simple/
Collecting pandasql
  Downloading pandasql-0.7.3.tar.gz (26 kB)
Requirement already satisfied: numpy in /usr/local/lib/python3.7/dist-packages (from pandasql) (1.21.6)
Requirement already satisfied: pandas in /usr/local/lib/python3.7/dist-packages (from pandasql) (1.3.5)
Requirement already satisfied: sqlalchemy in /usr/local/lib/python3.7/dist-packages (from pandasql) (1.4.40)
Requirement already satisfied: python-dateutil>=2.7.3 in /usr/local/lib/python3.7/dist-packages (from pandas->pandasql) (2.8.2)
Requirement already satisfied: pytz>=2017.3 in /usr/local/lib/python3.7/dist-packages (from pandas->pandasql) (2022.2.1)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.7/dist-packages (from python-dateutil>=2.7.3->pandas->pandasql) (1.15.0)
Requirement already satisfied: importlib-metadata in /usr/local/lib/python3.7/dist-packages (from sqlalchemy->pandasql) (4.12.0)
Requirement already satisfied: greenlet!=0.4.17 in /usr/local/lib/python3.7/dist-packages (from sqlalchemy->pandasql) (1.1.2)
Requirement already satisfied: typing-extensions>=3.6.4 in /usr/local/lib/python3.7/dist-packages (from importlib-metadata->sqlalchemy->pandasql) (4.1.1)
Requirement already satisfied: zipp>=0.5 in /usr/local/lib/python3.7/dist-packages (from importlib-metadata->sqlalchemy->pandasql) (3.8.1)
Building wheels for collected packages: pandasql
  Building wheel for pandasql (setup.py) ... done
  Created wheel for pandasql: filename=pandasql-0.7.3-py3-none-any.whl size=26784 sha256=85a6201b5e2812b34fe1f3a121487f40d5e2077cfc138903dfd83bdb3efce440
  Stored in directory: /root/.cache/pip/wheels/5c/4b/ec/41f4e116c8053c3654e2c2a47c62b4fca34cc67ef7b55deb7f
Successfully built pandasql
Installing collected packages: pandasql
Successfully installed pandasql-0.7.3

In [2]:
# Required libraries

import pandas as pd          # used to read the DataFrame
import numpy  as np          # used to create the DataFrame

from pandasql import sqldf

# Data

This dataframe was created from imaginary data of students in a certain classroom

In [3]:
data = {'aluno'       : ['João', 'Ribeiro', 'Evaldo', 'Isaias', 'Jessyca','Anne','Luiz'],    
        'idade'       : ['20', '29', '22', '21', '35', '32', '40'],    
        'cidade'      : ['São Paulo', 'São João', 'Pinhal', 'Mococa', 'Poços', 'Botelhos', 'Pinhal'],
        'aniversario' : ['021004', '030220', np.nan, '000420', '871212', '000101', np.nan] }

df = pd.DataFrame(data)

In [4]:
# Data type correction

df['aniversario'] = pd.to_datetime( df['aniversario'], format = '%y%m%d' )
df['idade'] = df['idade'].astype(int)

In [5]:
df

     aluno  idade     cidade aniversario
0     João     20  São Paulo  2002-10-04
1  Ribeiro     29   São João  2003-02-20
2   Evaldo     22     Pinhal         NaT
3   Isaias     21     Mococa  2000-04-20
4  Jessyca     35      Poços  1987-12-12
5     Anne     32   Botelhos  2000-01-01
6     Luiz     40     Pinhal         NaT

In [6]:
data_empregados = {'aluno'       : ['João', 'Ribeiro', 'Isaias','Anne','Luiz'],    
                   'emprego'     : ['Mecanico', 'Mecanico', 'Farmaceutico', 'Professor', 'Enfermeiro'],    
                  }

df2 = pd.DataFrame(data_empregados)

In [7]:
df2

     aluno       emprego
0     João      Mecanico
1  Ribeiro      Mecanico
2   Isaias  Farmaceutico
3     Anne     Professor
4     Luiz    Enfermeiro

# SELECT

In [8]:
# Selecting all data

statement = "SELECT * FROM df LIMIT 5;"

selected_data = sqldf(statement, globals())

print(selected_data)

     aluno  idade     cidade                 aniversario
0     João     20  São Paulo  2002-10-04 00:00:00.000000
1  Ribeiro     29   São João  2003-02-20 00:00:00.000000
2   Evaldo     22     Pinhal                        None
3   Isaias     21     Mococa  2000-04-20 00:00:00.000000
4  Jessyca     35      Poços  1987-12-12 00:00:00.000000

In [9]:
# Selecting name and age

statement = "SELECT aluno, idade FROM df LIMIT 5;"

selected_data = sqldf(statement, globals())

print(selected_data)

     aluno  idade
0     João     20
1  Ribeiro     29
2   Evaldo     22
3   Isaias     21
4  Jessyca     35

Obs: The main function used in pandasql is sqldf. sqldf accepts 2 parametrs - a sql query string - an set of session/environment variables (locals() or globals())

# DISTINCT/ COUNT / AS

In [10]:
# Selecting distinct cities

statement = "SELECT DISTINCT cidade FROM df;"

selected_data = sqldf(statement, globals())

print(selected_data)

      cidade
0  São Paulo
1   São João
2     Pinhal
3     Mococa
4      Poços
5   Botelhos

In [11]:
# Counting the amount of distinct cities

statement = "SELECT COUNT(DISTINCT cidade) AS num_cities FROM df;"

selected_data = sqldf(statement, globals())

print(selected_data)

   num_cities
0           6

In [12]:
# Selecting distinct combinations of two cities

statement = "SELECT DISTINCT aluno, cidade FROM df;"

selected_data = sqldf(statement, globals())

print(selected_data)

     aluno     cidade
0     João  São Paulo
1  Ribeiro   São João
2   Evaldo     Pinhal
3   Isaias     Mococa
4  Jessyca      Poços
5     Anne   Botelhos
6     Luiz     Pinhal

# WHERE

In [13]:
# Selecting with a condition

statement = "SELECT * FROM df WHERE cidade = 'Pinhal';"

selected_data = sqldf(statement, globals())

print(selected_data)

    aluno  idade  cidade aniversario
0  Evaldo     22  Pinhal        None
1    Luiz     40  Pinhal        None

In [14]:
# Selecting the name of the students that lives in Pinhal

statement = "SELECT aluno FROM df WHERE cidade = 'Pinhal';"

selected_data = sqldf(statement, globals())

print(selected_data)

    aluno
0  Evaldo
1    Luiz

In [15]:
# Selecting the name of the students that lives in Pinhal or São Paulo

statement = "SELECT aluno FROM df WHERE cidade = 'Pinhal' OR cidade = 'São Paulo';"

selected_data = sqldf(statement, globals())

print(selected_data)

    aluno
0    João
1  Evaldo
2    Luiz

In [16]:
# Selecting the name of the students that do not lives in São Paulo and the age is greater than 25

statement = "SELECT aluno FROM df WHERE cidade != 'São Paulo' AND idade > 25;"

selected_data = sqldf(statement, globals())

print(selected_data)

     aluno
0  Ribeiro
1  Jessyca
2     Anne
3     Luiz

In [17]:
# Selecting names ending with 'iz' or starting with 'Je'

statement = "SELECT aluno FROM df WHERE aluno LIKE '%iz' OR aluno LIKE 'Je%';"

selected_data = sqldf(statement, globals())

print(selected_data)

     aluno
0  Jessyca
1     Luiz

In [18]:
# Selecting the average age of citizens of Pinhal

statement = "SELECT AVG(idade) AS mean_age FROM df WHERE cidade = 'Pinhal';"

selected_data = sqldf(statement, globals())

print(selected_data)

   mean_age
0      31.0

# ORDER BY

In [19]:
# Ordering the data by age ascending

statement = "SELECT idade FROM df ORDER BY idade;"

selected_data = sqldf(statement, globals())

print(selected_data)

   idade
0     20
1     21
2     22
3     29
4     32
5     35
6     40

In [20]:
# Ordering the data by age descending

statement = "SELECT idade FROM df ORDER BY idade DESC;"

selected_data = sqldf(statement, globals())

print(selected_data)

   idade
0     40
1     35
2     32
3     29
4     22
5     21
6     20

In [21]:
# Ordering the data by city ascending and then by age descending

statement = "SELECT cidade, idade FROM df ORDER BY cidade, idade DESC;"

selected_data = sqldf(statement, globals())

print(selected_data)

      cidade  idade
0   Botelhos     32
1     Mococa     21
2     Pinhal     40
3     Pinhal     22
4      Poços     35
5   São João     29
6  São Paulo     20

# GROUP BY

In [22]:
# Grouping the data by city and getting the max age

statement = "SELECT cidade, MAX(idade) FROM df GROUP BY cidade;"

selected_data = sqldf(statement, globals())

print(selected_data)

      cidade  MAX(idade)
0   Botelhos          32
1     Mococa          21
2     Pinhal          40
3      Poços          35
4   São João          29
5  São Paulo          20

In [23]:
# Grouping the data by city and getting the max age, ordering by max(age) ascending

statement = "SELECT cidade, MAX(idade) AS max_age FROM df GROUP BY cidade ORDER BY max_age;"

selected_data = sqldf(statement, globals())

print(selected_data)

      cidade  max_age
0  São Paulo       20
1     Mococa       21
2   São João       29
3   Botelhos       32
4      Poços       35
5     Pinhal       40

In [24]:
# Grouping the data by city and getting the max age, ordering by max(age) ascending with age > 30

statement = "SELECT cidade, MAX(idade) AS max_age FROM df WHERE idade > 30 GROUP BY cidade ORDER BY max_age;"

selected_data = sqldf(statement, globals())

print(selected_data)

     cidade  max_age
0  Botelhos       32
1     Poços       35
2    Pinhal       40

In [25]:
# Getting the average age grouped by city and returning the city initials

statement = "SELECT SUBSTR(cidade, 1, 3) AS initials, AVG(idade) FROM df GROUP BY cidade;" # SUBSTR(cidade, 3) gets the last 3 characteres

selected_data = sqldf(statement, globals())

print(selected_data)

  initials  AVG(idade)
0      Bot        32.0
1      Moc        21.0
2      Pin        31.0
3      Poç        35.0
4      São        29.0
5      São        20.0

# Having

Kind of a condition to the WHERE clause

In [26]:
# Grouping the data by city and getting the average age, ordering by max(age) ascending with mean_age > 20

statement = "SELECT cidade, AVG(idade) AS max_age FROM df GROUP BY cidade HAVING max_age > 20 ORDER BY max_age;"

selected_data = sqldf(statement, globals())

print(selected_data)

     cidade  max_age
0    Mococa     21.0
1  São João     29.0
2    Pinhal     31.0
3  Botelhos     32.0
4     Poços     35.0

In [27]:
# Returning a column for the amount of citizens in each city

statement = " \
  SELECT cidade, SUM(CASE WHEN cidade = 'Pinhal' THEN 1 ELSE 0 END) AS citizens \
  FROM df \
  GROUP BY cidade; \
"

selected_data = sqldf(statement, globals())

print(selected_data)

# Extra: returning the percentage of students that lives in 'Pinhal

# statement = " \
#   SELECT aluno, SUM(CASE WHEN cidade = 'Pinhal' THEN 1.0 ELSE 0.0 END)/COUNT(*) AS frac_math \
#   FROM df; \
# "

      cidade  citizens
0   Botelhos         0
1     Mococa         0
2     Pinhal         2
3      Poços         0
4   São João         0
5  São Paulo         0

# JOINS

<img src = "https://miro.medium.com/max/1200/1*av8Om3HpG1MC7YTLKvyftg.png" width = 150%>

image-font = https://miro.medium.com/max/1200/1*av8Om3HpG1MC7YTLKvyftg.png

In [28]:
# Returning the age among working students

statement = " \
  SELECT S.aluno, W.emprego, idade \
  FROM df S \
  INNER JOIN df2 W ON S.aluno = W.aluno; \
"

selected_data = sqldf(statement, globals())

print(selected_data)

     aluno       emprego  idade
0     João      Mecanico     20
1  Ribeiro      Mecanico     29
2   Isaias  Farmaceutico     21
3     Anne     Professor     32
4     Luiz    Enfermeiro     40

In [29]:
# Returning the student and the average age among their profession

statement = " \
  SELECT S.aluno, W.emprego, AVG(idade) \
  FROM df S \
  INNER JOIN df2 W ON S.aluno = W.aluno \
  GROUP BY W.emprego \
  ORDER BY S.idade; \
"

selected_data = sqldf(statement, globals())

print(selected_data)

     aluno       emprego  AVG(idade)
0   Isaias  Farmaceutico        21.0
1  Ribeiro      Mecanico        24.5
2     Anne     Professor        32.0
3     Luiz    Enfermeiro        40.0

In [30]:
# Returning the students and their profession even if it's null

statement = " \
  SELECT S.aluno, W.emprego \
  FROM df S \
  LEFT JOIN df2 W ON S.aluno = W.aluno; \
"

selected_data = sqldf(statement, globals())

print(selected_data)

     aluno       emprego
0     João      Mecanico
1  Ribeiro      Mecanico
2   Evaldo          None
3   Isaias  Farmaceutico
4  Jessyca          None
5     Anne     Professor
6     Luiz    Enfermeiro

In [31]:
# Returning the students who don't work

statement = " \
  SELECT S.aluno \
  FROM df S \
  LEFT JOIN df2 W ON S.aluno = W.aluno \
  WHERE W.aluno IS NULL; \
"

selected_data = sqldf(statement, globals())

print(selected_data)

     aluno
0   Evaldo
1  Jessyca

In [32]:
# Getting the percentage of students who work among the cities

statement = " \
  SELECT S.cidade, SUM(CASE WHEN emprego IS NOT NULL THEN 1.0 ELSE 0.0 END)/COUNT(*) AS frac_working \
  FROM df S \
  LEFT JOIN df2 W ON S.aluno = W.aluno \
  GROUP BY cidade; \
"

selected_data = sqldf(statement, globals())

print(selected_data)

      cidade  frac_working
0   Botelhos           1.0
1     Mococa           1.0
2     Pinhal           0.5
3      Poços           0.0
4   São João           1.0
5  São Paulo           1.0

In [33]:
# Getting the percentage of students who work among the cities and returning the cities with 100%

statement = " \
  SELECT S.cidade, SUM(CASE WHEN emprego IS NOT NULL THEN 1.0 ELSE 0.0 END)/COUNT(*) AS frac_working \
  FROM df S \
  LEFT JOIN df2 W ON S.aluno = W.aluno \
  GROUP BY cidade \
  HAVING frac_working = 1.0; \
"

selected_data = sqldf(statement, globals())

print(selected_data)

      cidade  frac_working
0   Botelhos           1.0
1     Mococa           1.0
2   São João           1.0
3  São Paulo           1.0

# SELF JOIN

In [34]:
# Returning the difference in age between two students

statement = " \
  SELECT S1.aluno AS student_1, S1.idade AS age_student_1, \
   S2.aluno AS student_2, S2.idade as age_student_2, \
   ABS(S1.idade - S2.idade) AS age_dif \
  FROM df S1 INNER JOIN df S2\
  WHERE S1.aluno != S2.aluno \
  LIMIT 10; \
"
# note that 'INNER JOIN' can be replaced by ','

selected_data = sqldf(statement, globals())

print(selected_data)

  student_1  age_student_1 student_2  age_student_2  age_dif
0      João             20   Ribeiro             29        9
1      João             20    Evaldo             22        2
2      João             20    Isaias             21        1
3      João             20   Jessyca             35       15
4      João             20      Anne             32       12
5      João             20      Luiz             40       20
6   Ribeiro             29      João             20        9
7   Ribeiro             29    Evaldo             22        7
8   Ribeiro             29    Isaias             21        8
9   Ribeiro             29   Jessyca             35        6

In [35]:
# Taking the average of all the absolute age differences

statement = " \
  SELECT AVG( ABS(S1.idade - S2.idade) ) AS age_avg_absdiff \
  FROM df S1, df S2 \
  WHERE S1.aluno != S2.aluno; \
"

selected_data = sqldf(statement, globals())

print(selected_data)

   age_avg_absdiff
0         9.333333

# SQLITE

In [36]:
# Biblioteca necessária

import sqlite3

In [37]:
# Create a database connection
conn = sqlite3.connect('df2.db')

# Create a cursor
cur = conn.cursor()

In [38]:
# Fuction that displays the result as a table

def display_as_table(data, headers):
  df3 = pd.DataFrame(data = data, columns = [i[0] for i in headers])
  return df3

# CREATE TABLE

In [39]:
# Creating the Students table

cur.execute("CREATE TABLE IF NOT EXISTS Students(Name text, GPA float, Major text, Year integer)")

In [40]:
# Display Students table

cur.execute("SELECT * FROM Students")
display_as_table(cur.fetchall(), cur.description)

Empty DataFrame
Columns: [Name, GPA, Major, Year]
Index: []

# INSERT INTO

In [41]:
# Inserting a student into the table

cur.execute("INSERT INTO Students VALUES ('Joao', 2.9, 'Math', 3)")

cur.execute("Select * FROM Students")

display_as_table(cur.fetchall(), cur.description)

   Name  GPA Major  Year
0  Joao  2.9  Math     3

In [42]:
# Saving the modifications with SQLITE

conn.commit()

In [43]:
cur.execute('''INSERT INTO Students VALUES 
            ('Marcio', 2.9, 'Math', 3),
            ('Maria', 3.9, 'Math', 3),
            ('Carlos', 2.5, 'Math', 3),
            ('Antonio', 2.7, 'Math', 3),
            ('Joao Cleber', 3.5, 'Math', 3)''')  # note that you can use ''' instead of \ every line

cur.execute("Select * FROM Students")

display_as_table(cur.fetchall(), cur.description)

          Name  GPA Major  Year
0         Joao  2.9  Math     3
1       Marcio  2.9  Math     3
2        Maria  3.9  Math     3
3       Carlos  2.5  Math     3
4      Antonio  2.7  Math     3
5  Joao Cleber  3.5  Math     3

In [44]:
conn.commit()

In [45]:
# Returning the results with GPA greater than 3

statement = " \
  SELECT Name, Major, GPA \
  FROM Students \
  WHERE GPA > 3.0; \
"

cur.execute(statement)
display_as_table(cur.fetchall(), cur.description)

          Name Major  GPA
0        Maria  Math  3.9
1  Joao Cleber  Math  3.5

In [46]:
# Inserting into certain columns

statement = " \
  INSERT INTO Students(Name, Major, Year) VALUES ('Maul', 'Math', 1); "

cur.execute(statement)
cur.execute("SELECT * FROM Students")

display_as_table(cur.fetchall(), cur.description)

conn.commit()

In [47]:
# Getting students with null GPA

statement = " \
  SELECT Name \
  FROM Students \
  WHERE GPA IS NULL; "

cur.execute(statement)

display_as_table(cur.fetchall(), cur.description)

   Name
0  Maul

**INSERT records from another table**

In [48]:
# Creating a second table
cur.execute("CREATE TABLE IF NOT EXISTS NewStudents(Name text, GPA float, Major text, Year integer)") # we could use varchar(255) instead of text for example
cur.execute('''INSERT INTO NewStudents VALUES 
            ('Jessica', 2.0, 'Physics', 1),
            ('Tarcisio', 4.0, 'History', 2)''')

cur.execute("INSERT INTO Students SELECT * FROM NewStudents")

cur.execute("SELECT * FROM Students")
display_as_table(cur.fetchall(), cur.description)

          Name  GPA    Major  Year
0         Joao  2.9     Math     3
1       Marcio  2.9     Math     3
2        Maria  3.9     Math     3
3       Carlos  2.5     Math     3
4      Antonio  2.7     Math     3
5  Joao Cleber  3.5     Math     3
6         Maul  NaN     Math     1
7      Jessica  2.0  Physics     1
8     Tarcisio  4.0  History     2

# UPDATE

In [49]:
cur.execute("UPDATE Students SET Major = 'geograph' WHERE Major = 'Physics'")

cur.execute("SELECT * FROM Students")
display_as_table(cur.fetchall(), cur.description)

          Name  GPA     Major  Year
0         Joao  2.9      Math     3
1       Marcio  2.9      Math     3
2        Maria  3.9      Math     3
3       Carlos  2.5      Math     3
4      Antonio  2.7      Math     3
5  Joao Cleber  3.5      Math     3
6         Maul  NaN      Math     1
7      Jessica  2.0  geograph     1
8     Tarcisio  4.0   History     2

In [50]:
conn.commit()

**Be careful to put the WHERE condition! Otherwise you'll update the whole column**

In [51]:
cur.execute("UPDATE Students SET Major = 'geograph'")

cur.execute("SELECT * FROM Students")
display_as_table(cur.fetchall(), cur.description)

          Name  GPA     Major  Year
0         Joao  2.9  geograph     3
1       Marcio  2.9  geograph     3
2        Maria  3.9  geograph     3
3       Carlos  2.5  geograph     3
4      Antonio  2.7  geograph     3
5  Joao Cleber  3.5  geograph     3
6         Maul  NaN  geograph     1
7      Jessica  2.0  geograph     1
8     Tarcisio  4.0  geograph     2

In [52]:
conn.rollback() # Rolling back to fix the mistake

cur.execute("SELECT * FROM Students")
display_as_table(cur.fetchall(), cur.description)

          Name  GPA     Major  Year
0         Joao  2.9      Math     3
1       Marcio  2.9      Math     3
2        Maria  3.9      Math     3
3       Carlos  2.5      Math     3
4      Antonio  2.7      Math     3
5  Joao Cleber  3.5      Math     3
6         Maul  NaN      Math     1
7      Jessica  2.0  geograph     1
8     Tarcisio  4.0   History     2

In [53]:
# Also works with more conditions

cur.execute("UPDATE Students SET Major = 'geograph' WHERE Major = 'Math' and Year = 1")

cur.execute("SELECT * FROM Students")
display_as_table(cur.fetchall(), cur.description)

          Name  GPA     Major  Year
0         Joao  2.9      Math     3
1       Marcio  2.9      Math     3
2        Maria  3.9      Math     3
3       Carlos  2.5      Math     3
4      Antonio  2.7      Math     3
5  Joao Cleber  3.5      Math     3
6         Maul  NaN  geograph     1
7      Jessica  2.0  geograph     1
8     Tarcisio  4.0   History     2

In [54]:
conn.commit()

# ALTER TABLE

In [55]:
cur.execute("SELECT * FROM Students")
display_as_table(cur.fetchall(), cur.description)

          Name  GPA     Major  Year
0         Joao  2.9      Math     3
1       Marcio  2.9      Math     3
2        Maria  3.9      Math     3
3       Carlos  2.5      Math     3
4      Antonio  2.7      Math     3
5  Joao Cleber  3.5      Math     3
6         Maul  NaN  geograph     1
7      Jessica  2.0  geograph     1
8     Tarcisio  4.0   History     2

In [56]:
# Adding a new column
cur.execute("ALTER TABLE Students ADD COLUMN InSate bit(1)")  # bit(1) e a True or False type of data

cur.execute("SELECT * FROM Students")
display_as_table(cur.fetchall(), cur.description)

          Name  GPA     Major  Year InSate
0         Joao  2.9      Math     3   None
1       Marcio  2.9      Math     3   None
2        Maria  3.9      Math     3   None
3       Carlos  2.5      Math     3   None
4      Antonio  2.7      Math     3   None
5  Joao Cleber  3.5      Math     3   None
6         Maul  NaN  geograph     1   None
7      Jessica  2.0  geograph     1   None
8     Tarcisio  4.0   History     2   None

In [57]:
# Renaming the column Students to StudentsData
cur.execute("ALTER TABLE Students RENAME to StudentsData")

cur.execute("SELECT * FROM StudentsData")
display_as_table(cur.fetchall(), cur.description)

          Name  GPA     Major  Year InSate
0         Joao  2.9      Math     3   None
1       Marcio  2.9      Math     3   None
2        Maria  3.9      Math     3   None
3       Carlos  2.5      Math     3   None
4      Antonio  2.7      Math     3   None
5  Joao Cleber  3.5      Math     3   None
6         Maul  NaN  geograph     1   None
7      Jessica  2.0  geograph     1   None
8     Tarcisio  4.0   History     2   None

In [58]:
# Trying to access the table Students that was renamed

# cur.execute("SELECT * FROM Students")
# display_as_table(cur.fetchall(), cur.description)

# DROP TABLE

In [59]:
# Drop the table NewStudents
cur.execute("DROP TABLE NewStudents")

In [60]:
# Trying to access the NewStudents table

# cur.execute("SELECT * FROM NewStudents")
# display_as_table(cur.fetchall(), cur.description)

# SQL INJECTION

SQL injection is a code injection technique that might destroy your database. 

SQL injection is one of the most common web hacking techniques.

In [61]:
cur.execute("SELECT * FROM StudentsData")
display_as_table(cur.fetchall(), cur.description)

          Name  GPA     Major  Year InSate
0         Joao  2.9      Math     3   None
1       Marcio  2.9      Math     3   None
2        Maria  3.9      Math     3   None
3       Carlos  2.5      Math     3   None
4      Antonio  2.7      Math     3   None
5  Joao Cleber  3.5      Math     3   None
6         Maul  NaN  geograph     1   None
7      Jessica  2.0  geograph     1   None
8     Tarcisio  4.0   History     2   None

In [62]:
# In the system, there is a field to update the name and gpa of a student

def update_student_gpa(name, gpa):
  statement = "UPDATE StudentsData SET GPA=%s WHERE Name=%s"%(gpa, name)
  cur.executescript(statement)

In [63]:
# Ex. updating Maria GPA to 3.3

update_student_gpa('"Maria"', 3.3)

cur.execute("SELECT * FROM StudentsData")
display_as_table(cur.fetchall(), cur.description)

          Name  GPA     Major  Year InSate
0         Joao  2.9      Math     3   None
1       Marcio  2.9      Math     3   None
2        Maria  3.3      Math     3   None
3       Carlos  2.5      Math     3   None
4      Antonio  2.7      Math     3   None
5  Joao Cleber  3.5      Math     3   None
6         Maul  NaN  geograph     1   None
7      Jessica  2.0  geograph     1   None
8     Tarcisio  4.0   History     2   None

In [64]:
# Using the SQL Injection to drop the table StudentsData
# WARNING: It will drop the whole table

# update_student_gpa('"Maria"; DROP TABLE StudentsData;', 0)

## Better (safer) way

This technique is called parameterized queries (querys with placeholders parameters and cast as a string instead of a command)

In [65]:
def update_student_gpa(name, gpa):
  statement = "UPDATE StudentsData SET GPA=? WHERE Name=?"  # ? is a placeholder here
  cur.executemany(statement, [(gpa, name)])

In [66]:
update_student_gpa("Antonio", 4.0)

cur.execute("SELECT * FROM StudentsData")
display_as_table(cur.fetchall(), cur.description)

          Name  GPA     Major  Year InSate
0         Joao  2.9      Math     3   None
1       Marcio  2.9      Math     3   None
2        Maria  3.3      Math     3   None
3       Carlos  2.5      Math     3   None
4      Antonio  4.0      Math     3   None
5  Joao Cleber  3.5      Math     3   None
6         Maul  NaN  geograph     1   None
7      Jessica  2.0  geograph     1   None
8     Tarcisio  4.0   History     2   None

In [67]:
update_student_gpa('"Maria"; DROP TABLE StudentsData;', 0)

In [68]:
cur.execute("SELECT * FROM StudentsData")
display_as_table(cur.fetchall(), cur.description) # Look how it stays intact

          Name  GPA     Major  Year InSate
0         Joao  2.9      Math     3   None
1       Marcio  2.9      Math     3   None
2        Maria  3.3      Math     3   None
3       Carlos  2.5      Math     3   None
4      Antonio  4.0      Math     3   None
5  Joao Cleber  3.5      Math     3   None
6         Maul  NaN  geograph     1   None
7      Jessica  2.0  geograph     1   None
8     Tarcisio  4.0   History     2   None

# Primary key

It's a column or a collection of columns that satisfies 3 conditions:

1.   The column has to be unique
2.   No Null values on the column
3.   Each table has at most 1 primary key

In [69]:
# Create Students2 table with primary key

statement = '''
CREATE TABLE Students2 (
Name varchar(255) NOT NULL,
GPA float CHECK (GPA <= 4 AND GPA >= 0),
Major VARCHAR(255) NOT NULL,
Year integer DEFAULT 1,
CONSTRAINT name_pk PRIMARY KEY (Name)
);
'''

# Obs: When you set name to be a primary key, you don't need to declare it as UNIQUE

cur.execute(statement)

In [70]:
cur.execute("INSERT INTO Students2 VALUES ('YODA', 3.5, 'Physics', 3)")
cur.execute("INSERT INTO Students2 VALUES ('Vader', 3.2, 'Math', 3)")
cur.execute("INSERT INTO Students2 VALUES ('Kylo', 3.9, 'Physics', 2)")

In [71]:
cur.execute("SELECT * FROM Students2")
display_as_table(cur.fetchall(), cur.description)

    Name  GPA    Major  Year
0   YODA  3.5  Physics     3
1  Vader  3.2     Math     3
2   Kylo  3.9  Physics     2

In [72]:
# Trying to insert another student Yoda in the column name (wich is a primary key)

# cur.execute("INSERT INTO Students2 VALUES ('YODA', 3.2, 'CS', 2)")

In [73]:
# Trying to let the column Name (pk) to be null

# cur.execute("INSERT INTO Students2 (GPA, Major, Year) VALUES (3.2, 'History', 3)")

## Multi-Column Primary Key

In [74]:
# Create Students3 table with multi-column PK

statement = '''
CREATE TABLE Students3 (
Name varchar(255) NOT NULL,
GPA float CHECK (GPA <= 4 AND GPA >= 0),
Major varchar(255) NOT NULL,
Year integer DEFAULT 1,
CONSTRAINT name_major_year_pk PRIMARY KEY (Name, Major, Year)
);
'''

cur.execute(statement)

In [75]:
cur.execute("INSERT INTO Students3 VALUES ('YODA', 3.5, 'Physics', 3)")
cur.execute("INSERT INTO Students3 VALUES ('Vader', 3.2, 'Math', 3)")
cur.execute("INSERT INTO Students3 VALUES ('Kylo', 3.9, 'Physics', 2)")

cur.execute("SELECT * FROM Students3")
display_as_table(cur.fetchall(), cur.description)

    Name  GPA    Major  Year
0   YODA  3.5  Physics     3
1  Vader  3.2     Math     3
2   Kylo  3.9  Physics     2

In [76]:
# Trying to insert another student with the same collection (Name, Major, Year) as ('YODA', 3.5, 'Physics', 3)

# cur.execute("INSERT INTO Students3 VALUES ('YODA', 3.0, 'Physics', 3)")

## Auto-Incrementing Integer Primary Key

In [77]:
# Create Students4 table with auto incrementing pk

statement = '''
CREATE TABLE Students4 (
StudentId integer NOT NULL PRIMARY KEY AUTOINCREMENT,
Name varchar(255) NOT NULL,
GPA float CHECK (GPA <= 4 AND GPA >= 0),
Major varchar(255) NOT NULL,
Year integer DEFAULT 1
);
'''

cur.execute(statement)

In [78]:
cur.execute("INSERT INTO Students4 (Name, GPA, Major, Year) VALUES ('YODA', 3.5, 'Physics', 3)")
cur.execute("INSERT INTO Students4 (Name, GPA, Major, Year) VALUES ('Vader', 3.2, 'Math', 3)")
cur.execute("INSERT INTO Students4 (Name, GPA, Major, Year) VALUES ('Kylo', 3.9, 'Physics', 2)")

cur.execute("SELECT * FROM Students4")
display_as_table(cur.fetchall(), cur.description)

   StudentId   Name  GPA    Major  Year
0          1   YODA  3.5  Physics     3
1          2  Vader  3.2     Math     3
2          3   Kylo  3.9  Physics     2

In [79]:
# Deleting the student Vader (wich id equals '2') so we see what happens with the column id

cur.execute("DELETE FROM Students4 WHERE Name = 'Vader'")

cur.execute("SELECT * FROM Students4")
display_as_table(cur.fetchall(), cur.description)

   StudentId  Name  GPA    Major  Year
0          1  YODA  3.5  Physics     3
1          3  Kylo  3.9  Physics     2

## Trying to create 2 primary keys on a table

In [80]:
# statement = '''
# CREATE TABLE Students5 (
# Name varchar(255) NOT NULL,
# GPA float CHECK (GPA <= 4 AND GPA >= 0),
# Major varchar(255) NOT NULL,
# Year integer DEFAULT 1,
# CONSTRAINT name_major_year_pk PRIMARY KEY (Name),
# CONSTRAINT name_major_year_pk PRIMARY KEY (Year)
# );
# '''

# cur.execute(statement)

# Foreing Key

In [81]:
statement = "PRAGMA foreign_keys = ON;"

conn.execute(statement)

In [82]:
statement = '''
CREATE TABLE Students6 (
Name varchar(255) NOT NULL,
GPA float CHECK (GPA <= 4 AND GPA >= 0),
Major VARCHAR(255) NOT NULL,
Year integer DEFAULT 1,
CONSTRAINT name_pk PRIMARY KEY (Name)
);
'''

cur.execute(statement)

In [83]:
cur.execute("INSERT INTO Students6 (Name, GPA, Major, Year) VALUES ('YODA', 3.5, 'Physics', 3)")
cur.execute("INSERT INTO Students6 (Name, GPA, Major, Year) VALUES ('Vader', 3.2, 'Math', 3)")
cur.execute("INSERT INTO Students6 (Name, GPA, Major, Year) VALUES ('Kylo', 3.9, 'Physics', 2)")

cur.execute("SELECT * FROM Students6")
display_as_table(cur.fetchall(), cur.description)

    Name  GPA    Major  Year
0   YODA  3.5  Physics     3
1  Vader  3.2     Math     3
2   Kylo  3.9  Physics     2

In [84]:
# Create enrollment table

statement = '''
CREATE TABLE Enrollment(
CourseName varchar(255) NOT NULL,
StudentName varchar(255) NOT NULL
);
'''

cur.execute(statement)
cur.execute("INSERT INTO Enrollment VALUES ('Thermodynamics', 'Yoda')")
cur.execute("INSERT INTO Enrollment VALUES ('Thermodynamics', 'Kylo')")
cur.execute("INSERT INTO Enrollment VALUES ('Calculus', 'Vader')")


cur.execute("SELECT * FROM Enrollment")
display_as_table(cur.fetchall(), cur.description)

       CourseName StudentName
0  Thermodynamics        Yoda
1  Thermodynamics        Kylo
2        Calculus       Vader

In [85]:
# Should not be allowed: Adding Student to Enrollment tale who does not exist

cur.execute("INSERT INTO Enrollment VALUES ('Calculus', 'Rey')")

cur.execute("SELECT * FROM Enrollment")
display_as_table(cur.fetchall(), cur.description)

       CourseName StudentName
0  Thermodynamics        Yoda
1  Thermodynamics        Kylo
2        Calculus       Vader
3        Calculus         Rey

In [86]:
# Should not be allowed: Delete student from Students if it leaves orphans

cur.execute("DELETE FROM Students6 WHERE Name='Kylo'") # Will leave records of Kylo in the enrollment table

cur.execute("SELECT * FROM Students6")
display_as_table(cur.fetchall(), cur.description)

    Name  GPA    Major  Year
0   YODA  3.5  Physics     3
1  Vader  3.2     Math     3

Look the linkage errors between the two tables

Fixing the problem by adding foreign keys in the enrollment2 table

In [87]:
statement = '''
CREATE TABLE Students7 (
Name varchar(255) NOT NULL,
GPA float CHECK (GPA <= 4 AND GPA >= 0),
Major VARCHAR(255) NOT NULL,
Year integer DEFAULT 1,
CONSTRAINT name_pk PRIMARY KEY (Name)
);
'''

cur.execute(statement)

cur.execute("INSERT INTO Students7 (Name, GPA, Major, Year) VALUES ('YODA', 3.5, 'Physics', 3)")
cur.execute("INSERT INTO Students7 (Name, GPA, Major, Year) VALUES ('Vader', 3.2, 'Math', 3)")
cur.execute("INSERT INTO Students7 (Name, GPA, Major, Year) VALUES ('Kylo', 3.9, 'Physics', 2)")

cur.execute("SELECT * FROM Students7")
display_as_table(cur.fetchall(), cur.description)

    Name  GPA    Major  Year
0   YODA  3.5  Physics     3
1  Vader  3.2     Math     3
2   Kylo  3.9  Physics     2

In [88]:
# Create enrollment table

statement = '''
CREATE TABLE Enrollment2(
CourseName varchar(255) NOT NULL,
StudentName varchar(255) NOT NULL,
FOREIGN KEY (StudentName) REFERENCES Students7 (Name)
);
''' # connecting the two tables by StudentName (Enrollment2) and Name (Students7)

cur.execute(statement)

cur.execute("INSERT INTO Enrollment2 VALUES ('Thermodynamics', 'YODA')")
cur.execute("INSERT INTO Enrollment2 VALUES ('Thermodynamics', 'Kylo')")
cur.execute("INSERT INTO Enrollment2 VALUES ('Calculus', 'Vader')")


cur.execute("SELECT * FROM Enrollment2")
display_as_table(cur.fetchall(), cur.description)

       CourseName StudentName
0  Thermodynamics        YODA
1  Thermodynamics        Kylo
2        Calculus       Vader

In [89]:
# Should not be allowed: Adding Student to Enrollment tale who does not exist

cur.execute("INSERT INTO Enrollment2 VALUES ('Calculus', 'Rey')")

In [90]:
# Should not be allowed: Delete student from Students if it leaves orphans

cur.execute("DELETE FROM Students7 WHERE Name='Kylo'") # Will leave records of Kylo in the enrollment table

# VIEWS

In [97]:
# Creating a agreggate view

cur.execute('''
CREATE VIEW MajorInfo AS
SELECT Major, COUNT(*) AS NumStudents, AVG(GPA) AS AvgGPA
FROM Students6
GROUP BY Major
''')

cur.execute("SELECT * FROM MajorInfo")
display_as_table(cur.fetchall(), cur.description)

     Major  NumStudents  AvgGPA
0     Math            1     3.2
1  Physics            1     3.5

It behaves like a table, but it's just a visualization

The select * from VIEW command will replicate the statement that created the VIEW, instead of looking into a physical table

In [98]:
# inserting data into the table that originated the view

cur.execute("INSERT INTO Students6 VALUES ('R2D2', 2.9, 'Math', 2)")

cur.execute("SELECT * FROM MajorInfo")
display_as_table(cur.fetchall(), cur.description)

# Look how the Avg changes

     Major  NumStudents  AvgGPA
0     Math            2    3.05
1  Physics            1    3.50

Views advantages:

1. Privacity: You protect the Original Data
2. Simplicity: Turn querys into a simple table

Disadvantages:

1. Complexity: You run the query every time you select the view

In [ ]:
# Trying to insert into the view

# cur.execute("INSERT INTO MajorInfo VALUES ('CS', 2.9, 'Math', 2)")

In [99]:
# Drop the view

cur.execute('DROP VIEW MajorInfo;')